config-org/appearance.org
#+TITLE: Appearance
#+PROPERTY: header-args      :tangle "../config-elisp/appearance.el"
* Circadian
#+BEGIN_SRC emacs-lisp
(use-package circadian
  :ensure t
  :config
  (setq circadian-themes '(("7:00" . modus-operandi)
                           ("17:30" . modus-vivendi)))
  (circadian-setup))
#+END_SRC
* Default Font
#+BEGIN_SRC emacs-lisp
(set-face-attribute 'default nil :font "Iosevka 14")
#+END_SRC
* Default Cursor
#+BEGIN_SRC emacs-lisp
(blink-cursor-mode 1)
(use-package bar-cursor :ensure t :hook ((after-init . bar-cursor-mode)))
#+END_SRC
* Display Time
#+BEGIN_SRC emacs-lisp
(setq display-time-default-load-average nil)
(setq display-time-format "%I:%M%p")
(display-time-mode t)
#+END_SRC
* Modern Fringes
#+BEGIN_SRC emacs-lisp
(use-package modern-fringes
  :ensure t
  :hook (after-init . modern-fringes-mode)
  :config
  (set-fringe-mode '(7 . 0)))
#+END_SRC
* Pretty Symbols
#+BEGIN_SRC emacs-lisp
(global-prettify-symbols-mode 1)
(load-file "~/.emacs.d/elisp/pretty-fonts.el")
(pretty-fonts-set-kwds
  '((pretty-fonts-fira-font prog-mode-hook org-mode-hook)))
#+END_SRC
* Theme Switching
#+BEGIN_SRC emacs-lisp
(defun disable-all-themes ()
  "disable all active themes."
  (dolist (i custom-enabled-themes)
    (disable-theme i)))

(defadvice load-theme (before disable-themes-first activate)
  (disable-all-themes))
#+END_SRC
* Truncate Lines
#+BEGIN_SRC emacs-lisp
(setq-default truncate-lines -1)
#+END_SRC
